Merge branch 'main' into feat/frontend-header-responsive-styling
